# Birth Names Data

In [25]:
# Import Dependencies
import pandas as pd
import glob
from sqlalchemy import create_engine
import psycopg2
import json
# from secret import username, password

In [26]:
#Import csv files

# Use glob module to include all csv files together
all_files = glob.glob('Resources/*.csv')

# Create and empty list to append to 
li = []

# Write a for loop to import all csv files, include headers
for filename in all_files:
    df = pd.read_csv(filename, index_col=None, header=None, names = ['State','Sex', 'Year','Name', 'Number'])
    li.append(df)
    
# Concatenate all csv files 
names_df = pd.concat(li, axis=0, ignore_index=True)

In [27]:
# Check DataFrame
# names_df=names_df.loc[names_df["year"]>=2000]
names_df

        State Sex  Year      Name  Number
0          AK   F  1910      Mary      14
1          AK   F  1910     Annie      12
2          AK   F  1910      Anna      10
3          AK   F  1910  Margaret       8
4          AK   F  1910     Helen       7
...       ...  ..   ...       ...     ...
6028146    WY   M  2018    Peyton       5
6028147    WY   M  2018   Richard       5
6028148    WY   M  2018     Titus       5
6028149    WY   M  2018   Tristan       5
6028150    WY   M  2018    Zander       5

[6028151 rows x 5 columns]

In [28]:
names_df=names_df.loc[(names_df["Year"]>=1980) & (names_df["Number"]>1000 )]
names_df

        State Sex  Year         Name  Number
74692      AL   F  1987       Ashley    1011
137446     AL   M  1982  Christopher    1077
137966     AL   M  1983  Christopher    1061
138471     AL   M  1984  Christopher    1098
138958     AL   M  1985  Christopher    1104
...       ...  ..   ...          ...     ...
5901045    WI   M  1988      Matthew    1043
5901046    WI   M  1988       Andrew    1016
5901558    WI   M  1989      Michael    1149
5902095    WI   M  1990      Michael    1149
5902646    WI   M  1991      Michael    1065

[10279 rows x 5 columns]

In [29]:
# Check info of DataFrame
names_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10279 entries, 74692 to 5902646
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   10279 non-null  object
 1   Sex     10279 non-null  object
 2   Year    10279 non-null  int64
 3   Name    10279 non-null  object
 4   Number  10279 non-null  int64
dtypes: int64(2), object(3)
memory usage: 481.8+ KB

In [30]:
names_df.to_csv('Data/ALL_STATES.csv')

In [36]:
result = df.to_json(orient="index")
parsed = json.loads(result)
json_file = json.dumps(parsed, indent=4)  

json_file.to_json(path='Data/ALL_STATES.js')

AttributeError: 'str' object has no attribute 'to_json'

In [ ]:
# Create database connection
connection_string = f'postgres:Koudede$89@localhost:5432/babynames_db'
engine = create_engine(f'postgresql+psycopg2://{connection_string}')

In [ ]:
engine.table_names()

In [ ]:
names_df.to_sql(name='baby_names', con=engine, if_exists='append', index=False)

In [ ]:
pd.read_sql_query('select* from baby_names limit(10)', con=engine).head()